export const CASE_CONTENT = [
    [
        {
            template: 'Head',
            title: 'Vikson-Eng',
            link: 'https://vikson-eng.com',
            imgSrc: '../../images/case/vikson/head.png',
            details: [
                {
                    name: 'Клиент',
                    desc: 'Онлайн школа английского'
                },
                {
                    name: 'Тип проекта',
                    desc: 'Корпоративный сайт'
                },
                {
                    name: 'Область выполненной работы',
                    desc: 'Веб дизайн.'
                },
                {
                    name: 'Год',
                    desc: '2023'
                }
            ]
        },
        {
            template: 'Slider',
            info: '3 страницы [10 главных экранов]',
            link: 'https://vikson-eng.com',
            details: [
                {
                    template: 'Img',
                    name: 'Главная страница',
                    imgSrc: '../../images/case/vikson/slider-1.png',
                },
                {
                    template: 'Img',
                    name: 'Страница для учителей',
                    imgSrc: '../../images/case/vikson/slider-2.png'
                },
                {
                    template: 'Desc',
                    name: 'Информация о проекте',
                    details: {
                        project: 'Ко мне обратилась онлайн-школа английского языка с новой методикой преподавания. Моя задача заключалась в проектировании дизайна платформы для первого запуска MVP. Основная цель платформы - обеспечить участникам быструю и удобную возможность записи на консультации и покупку мини-курсов, предлагаемых школой. В настоящее время я нахожусь в тесном взаимодействии с платформой, и эта страница кейса, вероятно, будет обновляться по мере выпуска новых обновлений проекта. На данный момент весь трафик идет из инстраграмма. Статистика показала, что в день на плоатформу заходит около 5-8 пользователей, а в месяц цифра доходила до  800 пользователей',
                        process: 'Рабочий процесс продолжался почти полтора месяца и прошел очень гладко. Клиент не требовал кардинальных правок, в результате чего получил высокоэффективный инструмент, который успешно решает поставленные бизнес-задачи.',
                        reviewLink: ''
                    }
                },
                {
                    template: 'Img',
                    name: 'Консультация',
                    imgSrc: '../../images/case/vikson/slider-4.png'
                },
                {
                    template: 'Img',
                    name: 'Фиксированное меню',
                    imgSrc: '../../images/case/vikson/slider-5.png'
                },
                {
                    template: 'Img',
                    name: 'Страница вакансий',
                    imgSrc: '../../images/case/vikson/slider-6.png'
                }
            ]

        },
        {
            template: 'Animation',
            link: 'https://vikson-eng.com',
            imgSrc: '../../images/case/vikson/animation.png',
            bgcolor: '#5259FF',
            color: '#fff'

        },
        {
            template: 'Fragment',
            imgSrc: '../../images/case/vikson/fragment.jpg'
        },
        {
            template: 'Typography',
            fonts: [
                {
                    family: 'Inter',
                    weight: ['400']
                },
                {
                    family: 'Roboto',
                    weight: ['400']
                }
            ],
            details: [
                {
                    title: ['14 стилей'],
                    desc: [
                        'Шрифт Roboto, с его четкими геометрическими формами и элегантными линиями, придает проекту современный и стильный вид. Он обеспечивает отличную читаемость и привлекательность в текстовых блоках.',
                        'Шрифт Inter добавляет строгости и утонченности. Его гармоничные пропорции и четкость букв создают впечатление точности и аккуратности. Использование шрифта Inter подчеркивает профессионализм и серьезность проекта.',
                        'Сочетание этих шрифтов позволило создать идеальный баланс между современностью и строгостью. Они работают вместе в гармонии, усиливая эстетику проекта и создавая привлекательное визуальное впечатление.'
                    ]
                },
                {
                    title: ['400', '500', '600']
                }
            ]
        }
    ]
];
